kirisaki/s3r-llm/sdkconfig.defaults
# M5Stack AtomS3R (ESP32-S3-PICO-1-N8R8)
CONFIG_IDF_TARGET="esp32s3"

# 8MB flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# 8MB octal PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# The USB-C port is wired to the built-in USB Serial/JTAG controller
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# App plus partitions for the model and its tokenizer, see partitions.csv
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# The tokenizer and sampler want more than the default 3.5KB
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Inference speed: the weights are streamed from flash for every token
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
# 1ms ticks keep the per-token yield to the idle task short
CONFIG_FREERTOS_HZ=1000

# Leave the internal RAM to the model where WiFi can make do with PSRAM
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
